In [1]:
import numpy as np
import pandas as pd

### basics

In [2]:
dates = pd.date_range('1/1/2000',  periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

In [3]:
df

                   A         B         C         D
2000-01-01  1.014865 -0.479625  1.269125 -2.134611
2000-01-02  0.312159  2.452360 -2.009918  0.642444
2000-01-03  0.285121 -0.255409  0.312375  0.258942
2000-01-04  1.106386  0.373757 -0.403223  0.031455
2000-01-05 -0.258758 -2.077315  0.655228  0.432442
2000-01-06  0.428643  0.400507 -0.101970 -0.442787
2000-01-07 -0.128061  0.559686 -0.803589 -1.635786
2000-01-08  0.228382 -0.808479 -0.397520 -1.732934

In [4]:
panel = pd.Panel({'one': df, 'two': df - df.mean()})

/usr/local/lib/python3.5/dist-packages/IPython/core/interactiveshell.py:3265: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [5]:
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 8 (major_axis) x 4 (minor_axis)
Items axis: one to two
Major_axis axis: 2000-01-01 00:00:00 to 2000-01-08 00:00:00
Minor_axis axis: A to D

In [6]:
s = df['A']

In [7]:
s[dates[5]]

0.42864304263708847

In [8]:
panel['two']

                   A         B         C         D
2000-01-01  0.641273 -0.500310  1.454062 -1.562007
2000-01-02 -0.061433  2.431675 -1.824981  1.215049
2000-01-03 -0.088471 -0.276094  0.497312  0.831546
2000-01-04  0.732794  0.353071 -0.218286  0.604060
2000-01-05 -0.632350 -2.098000  0.840164  1.005047
2000-01-06  0.055051  0.379822  0.082966  0.129817
2000-01-07 -0.501653  0.539001 -0.618653 -1.063182
2000-01-08 -0.145210 -0.829164 -0.212584 -1.160329

In [9]:
df[['B', 'A']] = df[['A', 'B']]

In [10]:
df

                   A         B         C         D
2000-01-01 -0.479625  1.014865  1.269125 -2.134611
2000-01-02  2.452360  0.312159 -2.009918  0.642444
2000-01-03 -0.255409  0.285121  0.312375  0.258942
2000-01-04  0.373757  1.106386 -0.403223  0.031455
2000-01-05 -2.077315 -0.258758  0.655228  0.432442
2000-01-06  0.400507  0.428643 -0.101970 -0.442787
2000-01-07  0.559686 -0.128061 -0.803589 -1.635786
2000-01-08 -0.808479  0.228382 -0.397520 -1.732934

In [11]:
sa = pd.Series([1, 2, 3], index=list('abc'))
dfa = df.copy()

In [12]:
sa.b

2

In [13]:
dfa.A

2000-01-01   -0.479625
2000-01-02    2.452360
2000-01-03   -0.255409
2000-01-04    0.373757
2000-01-05   -2.077315
2000-01-06    0.400507
2000-01-07    0.559686
2000-01-08   -0.808479
Freq: D, Name: A, dtype: float64

In [14]:
panel.one

                   A         B         C         D
2000-01-01  1.014865 -0.479625  1.269125 -2.134611
2000-01-02  0.312159  2.452360 -2.009918  0.642444
2000-01-03  0.285121 -0.255409  0.312375  0.258942
2000-01-04  1.106386  0.373757 -0.403223  0.031455
2000-01-05 -0.258758 -2.077315  0.655228  0.432442
2000-01-06  0.428643  0.400507 -0.101970 -0.442787
2000-01-07 -0.128061  0.559686 -0.803589 -1.635786
2000-01-08  0.228382 -0.808479 -0.397520 -1.732934

In [15]:
sa.a = 5

In [16]:
sa

a    5
b    2
c    3
dtype: int64

In [17]:
dfa.A = list(range(len(dfa.index)))

In [18]:
dfa

            A         B         C         D
2000-01-01  0  1.014865  1.269125 -2.134611
2000-01-02  1  0.312159 -2.009918  0.642444
2000-01-03  2  0.285121  0.312375  0.258942
2000-01-04  3  1.106386 -0.403223  0.031455
2000-01-05  4 -0.258758  0.655228  0.432442
2000-01-06  5  0.428643 -0.101970 -0.442787
2000-01-07  6 -0.128061 -0.803589 -1.635786
2000-01-08  7  0.228382 -0.397520 -1.732934

In [19]:
dfa['A'] = list(range(len(dfa.index)))

In [20]:
dfa

            A         B         C         D
2000-01-01  0  1.014865  1.269125 -2.134611
2000-01-02  1  0.312159 -2.009918  0.642444
2000-01-03  2  0.285121  0.312375  0.258942
2000-01-04  3  1.106386 -0.403223  0.031455
2000-01-05  4 -0.258758  0.655228  0.432442
2000-01-06  5  0.428643 -0.101970 -0.442787
2000-01-07  6 -0.128061 -0.803589 -1.635786
2000-01-08  7  0.228382 -0.397520 -1.732934

In [21]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x.iloc[1] = {'x': 9, 'y': 99}

In [22]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [23]:
df = pd.DataFrame({'one': [1., 2., 3.]})

In [24]:
df.two = [4, 5, 6]

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [25]:
df

   one
0  1.0
1  2.0
2  3.0

In [26]:
s[:5]

2000-01-01   -0.479625
2000-01-02    2.452360
2000-01-03   -0.255409
2000-01-04    0.373757
2000-01-05   -2.077315
Freq: D, Name: A, dtype: float64

In [27]:
s[::2]

2000-01-01   -0.479625
2000-01-03   -0.255409
2000-01-05   -2.077315
2000-01-07    0.559686
Freq: 2D, Name: A, dtype: float64

In [28]:
s[::-1]

2000-01-08   -0.808479
2000-01-07    0.559686
2000-01-06    0.400507
2000-01-05   -2.077315
2000-01-04    0.373757
2000-01-03   -0.255409
2000-01-02    2.452360
2000-01-01   -0.479625
Freq: -1D, Name: A, dtype: float64

In [29]:
s2 = s.copy()

In [30]:
s2[:5] = 0

In [31]:
s2

2000-01-01    0.000000
2000-01-02    0.000000
2000-01-03    0.000000
2000-01-04    0.000000
2000-01-05    0.000000
2000-01-06    0.400507
2000-01-07    0.559686
2000-01-08   -0.808479
Freq: D, Name: A, dtype: float64

In [32]:
df[:3]

   one
0  1.0
1  2.0
2  3.0

In [33]:
df[::-1]

   one
2  3.0
1  2.0
0  1.0

In [34]:
df1 = pd.DataFrame(np.random.randn(6, 4), index=list('abcdef'), columns=list('ABCD'))

In [35]:
df1

          A         B         C         D
a  1.696338 -2.383276 -0.187433 -2.398855
b  0.270550 -2.502477  2.071586 -0.519327
c  1.316681  0.117499 -0.607653  0.232026
d -0.225470  0.678619 -2.179873 -0.304877
e  1.054185  1.679522 -0.244549 -0.891419
f -0.967220 -1.196088 -0.428059 -1.489592

In [36]:
df1.loc[lambda df: df.A > 0, :]

          A         B         C         D
a  1.696338 -2.383276 -0.187433 -2.398855
b  0.270550 -2.502477  2.071586 -0.519327
c  1.316681  0.117499 -0.607653  0.232026
e  1.054185  1.679522 -0.244549 -0.891419

In [37]:
df1.loc[:, lambda df: ['A', 'B']]

          A         B
a  1.696338 -2.383276
b  0.270550 -2.502477
c  1.316681  0.117499
d -0.225470  0.678619
e  1.054185  1.679522
f -0.967220 -1.196088

In [38]:
df1.iloc[:, lambda df: [0, 1]]

          A         B
a  1.696338 -2.383276
b  0.270550 -2.502477
c  1.316681  0.117499
d -0.225470  0.678619
e  1.054185  1.679522
f -0.967220 -1.196088

In [39]:
df1[lambda df: df.columns[0]]

a    1.696338
b    0.270550
c    1.316681
d   -0.225470
e    1.054185
f   -0.967220
Name: A, dtype: float64

In [40]:
s = pd.Series([0, 1, 2, 3, 4, 5])

In [41]:
s.sample()

0    0
dtype: int64

In [42]:
s.sample(n=3)

4    4
3    3
1    1
dtype: int64

In [43]:
s.sample(frac=0.5)

0    0
5    5
2    2
dtype: int64

In [44]:
s = pd.Series([0, 1, 2, 3, 4, 5])

In [45]:
s.sample(n=6, replace=False)

1    1
4    4
2    2
3    3
0    0
5    5
dtype: int64

In [46]:
s.sample(n=6, replace=True)

4    4
2    2
5    5
2    2
5    5
5    5
dtype: int64

In [51]:
s = pd.Series([0, 1, 2, 3, 4, 5])
example_weights = [0, 0, 0.2, 0.2, 0.2, 0.4]

In [52]:
s.sample(n=3, weights=example_weights)

5    5
2    2
3    3
dtype: int64

In [55]:
example_weights2 = [0.5, 0, 0, 0, 0, 0]

In [56]:
s.sample(n=1, weights=example_weights2)

0    0
dtype: int64

In [57]:
df2 = pd.DataFrame({
    'col1': [9, 8, 7, 6],
    'weight_column': [0.5, 0.4, 0.1, 0]
})

In [58]:
df2.sample(n=3, weights='weight_column')

   col1  weight_column
0     9            0.5
1     8            0.4
2     7            0.1

In [59]:
df3 = pd.DataFrame({'col1': [1, 2, 3], 'col2': [2, 3, 4]})

In [60]:
df3.sample(n=1, axis=1)

   col1
0     1
1     2
2     3

In [61]:
df4 = pd.DataFrame({
    'col1': [1, 2, 3],
    'col2': [2, 3, 4]
})

In [62]:
df4.sample(n=2, random_state=2)

   col1  col2
2     3     4
1     2     3

In [63]:
df4.sample(n=2, random_state=2)

   col1  col2
2     3     4
1     2     3

In [64]:
se = pd.Series([1, 2, 3])

In [65]:
se

0    1
1    2
2    3
dtype: int64

In [66]:
se[5] = 5.

In [67]:
se

0    1.0
1    2.0
2    3.0
5    5.0
dtype: float64

In [68]:
dfi = pd.DataFrame(np.arange(6).reshape(3, 2), columns=['A', 'B'])

In [69]:
dfi

   A  B
0  0  1
1  2  3
2  4  5

In [70]:
dfi.loc[:, 'C'] = dfi.loc[:, 'A']

In [71]:
dfi

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [72]:
dfi.loc[3] = 5
dfi

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4
3  5  5  5

In [73]:
s.iat[5]

5

In [80]:
df.iat[0, 0]

1.0